# +----------------------------------------------------------------------
# | DjangoAdmin敏捷开发框架 [ 赋能开发者，助力企业发展 ]
# +----------------------------------------------------------------------
# | 版权所有 2021~2023 北京DjangoAdmin研发中心
# +----------------------------------------------------------------------
# | Licensed LGPL-3.0 DjangoAdmin并不是自由软件，未经许可禁止去掉相关版权
# +----------------------------------------------------------------------
# | 官方网站: https://www.djangoadmin.cn
# +----------------------------------------------------------------------
# | 作者: @一米阳光 团队荣誉出品
# +----------------------------------------------------------------------
# | 版权和免责声明:
# | 本团队对该软件框架产品拥有知识产权（包括但不限于商标权、专利权、著作权、商业秘密等）
# | 均受到相关法律法规的保护，任何个人、组织和单位不得在未经本团队书面授权的情况下对所授权
# | 软件框架产品本身申请相关的知识产权，禁止用于任何违法、侵害他人合法权益等恶意的行为，禁
# | 止用于任何违反我国法律法规的一切项目研发，任何个人、组织和单位用于项目研发而产生的任何
# | 意外、疏忽、合约毁坏、诽谤、版权或知识产权侵犯及其造成的损失 (包括但不限于直接、间接、
# | 附带或衍生的损失等)，本团队不承担任何法律责任，本软件框架禁止任何单位和个人、组织用于
# | 任何违法、侵害他人合法利益等恶意的行为，如有发现违规、违法的犯罪行为，本团队将无条件配
# | 合公安机关调查取证同时保留一切以法律手段起诉的权利，本软件框架只能用于公司和个人内部的
# | 法律所允许的合法合规的软件产品研发，详细声明内容请阅读《框架免责声明》附件；
# +----------------------------------------------------------------------

# 性别
GENDER_LIST = {
    1: "男",
    2: "女",
    3: "保密",
}
# 部门类型
DEPT_TYPE_LIST = {
    1: "公司",
    2: "子公司",
    3: "部门",
    4: "小组",
}

# 站点类型
ITEM_TYPE_LIST = {
    1: "普通站点",
    2: "其他站点"
}

# 友链类型：1友情链接 2合作伙伴
LINK_TYPE_LIST = {
    1: "友情链接",
    2: "合作伙伴"
}

# 友链投放平台：1PC站 2WAP站 3微信小程序 4APP应用
LINK_PLATFORM_LIST = {
    1: "PC站",
    2: "WAP站",
    3: "微信小程序",
    4: "APP应用"
}

# 友链形式：1文字链接 2图片链接
LINK_FORM_LIST = {
    1: "文字链接",
    2: "图片链接",
}

# 广告投放平台：1PC站 2WAP站 3微信小程序 4APP应用
AD_SORT_PLATFORM_LIST = {
    1: "PC站",
    2: "WAP站",
    3: "微信小程序",
    4: "APP应用"
}

# 广告类型：1图片 2文字 3视频 4推荐
AD_TYPE_LIST = {
    1: "图片",
    2: "文字",
    3: "视频",
    4: "推荐"
}

# 通知来源：1官方平台 2开源中国 3CSDN官方 4新浪微博
NOTICE_SOURCE_LIST = {
    1: "官方平台",
    2: "开源中国",
    3: "CSDN官方",
    4: "新浪微博",
}

# 会员注册来源：1-网站注册 2-客户端注册 3-小程序注册 4-手机站注册 5-后台添加
MEMBER_SOURCE_LIST = {
    1: "网站注册",
    2: "客户端注册",
    3: "小程序注册",
    4: "手机站注册",
    5: "后台添加"
}

# 配置项类型
CONFIG_DATA_TYPE_LIST = {
    "text": "单行文本",
    "textarea": "多行文本",
    "ueditor": "富文本编辑器",
    "date": "日期",
    "datetime": "时间",
    "number": "数字",
    "select": "下拉框",
    "radio": "单选框",
    "checkbox": "复选框",
    "image": "单张图片",
    "images": "多张图片",
    "password": "密码",
    "icon": "字体图标",
    "file": "单个文件",
    "files": "多个文件",
    "hidden": "隐藏",
    "readonly": "只读文本",
}

# 菜单类型：0-菜单 1-节点
MENU_TYPE_LIST = {
    0: '菜单',
    1: '节点',
}

# 打开方式：1-内部打开 2-外部打开
MENU_TARGET_LIST = {
    1: '内部打开',
    2: '外部打开',
}

# 城市级别
CITY_LEVEL_LIST = {
    1: "省份",
    2: "城市",
    3: "县区",
    4: "街道"
}
